'use client';

import React, { useRef } from "react";
import Image from "next/image";
import Link from "next/link";
import { useIntl } from "react-intl";
import { Swiper, SwiperSlide } from "swiper/react";
import { Autoplay } from "swiper/modules";
import type { Swiper as SwiperType } from "swiper";
import "swiper/css";
import { projectsData, Project } from "../projects/data";
import ReusableTextWithArrows from "./ReusableTextWithArrows";

export default function BestSellerProjects() {
  const swiperRef = useRef<SwiperType | null>(null);
  const intl = useIntl();
  const locale = intl.locale;

  const staticImages = [
    "https://plus.unsplash.com/premium_photo-1661954372617-15780178eb2e?w=600&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8MXx8bHV4dXJ5JTIwaG9tZXN8ZW58MHx8MHx8fDA%3D",
    "https://images.unsplash.com/photo-1706808849780-7a04fbac83ef?w=600&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8NHx8bHV4dXJ5JTIwaG9tZXN8ZW58MHx8MHx8fDA%3D",
    "https://images.unsplash.com/photo-1706808849803-f61304e024ab?w=600&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1yZWxhdGVkfDd8fHxlbnwwfHx8fHw%3D",
    "https://images.unsplash.com/photo-1670589953882-b94c9cb380f5?w=600&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1yZWxhdGVkfDZ8fHxlbnwwfHx8fHw%3D"
  ];
 
  const topSellingProjects = projectsData
    .slice()
    .sort((a, b) => {
      const aSold = parseInt(
        intl
          .formatMessage({
            id: `projects.${a.slug}.description.typeOne`,
          })
          .replace('%', '')
      );
      const bSold = parseInt(
        intl
          .formatMessage({
            id: `projects.${b.slug}.description.typeOne`,
          })
          .replace('%', '')
      );
      return bSold - aSold;
    })
    .slice(0, 4);

  return (
    <section dir={locale === "ar" ? "rtl" : "ltr"} className="px-4 md:px-0">
      <div className="w-full">
        <ReusableTextWithArrows
          firstWord={intl.formatMessage({ id: "bs.first" })}
          secondWord={intl.formatMessage({ id: "bss.second" })}
  
          showContent={true}
          onPrev={() => swiperRef.current?.slidePrev()}
          onNext={() => swiperRef.current?.slideNext()}
          className="hidden md:flex"
        />

        <div className="hidden w-full md:block">
          <Swiper
            key={locale}
            modules={[Autoplay]}
            autoplay={{ delay: 3500 }}
            slidesPerView={1.9}
            centeredSlides
            spaceBetween={40}
            loop
            onSwiper={(s) => (swiperRef.current = s)}
            breakpoints={{
              0: { slidesPerView: 1, loop: false },
              768: { slidesPerView: 1, loop: false },
              1024: { slidesPerView: 1.9, loop: true },
            }}
          >
            {topSellingProjects.map((project: Project, idx: number) => (
              <SwiperSlide key={project.id}>
                <Link href={`/projects/${project.slug}`} className="block">
                  <div className="overflow-hidden transition-all duration-500 bg-white border border-gray-100 shadow-sm group hover:shadow-xl rounded-3xl">
                    {/* الصورة الرئيسية */}
                    <div className="relative w-full overflow-hidden h-96">
                      <Image
                        src={staticImages[idx % staticImages.length]}
                        alt={intl.formatMessage({
                          id: `projects.${project.slug}.title`,
                        })}
                        fill
                        className="object-cover transition-transform duration-700 group-hover:scale-110"
                      />

                      <div className="absolute flex flex-wrap items-center gap-2 top-4 left-4 right-4">
                        <div className="flex items-center gap-1 bg-white/90 backdrop-blur-md rounded-full px-4 py-2 shadow-sm max-w-[180px] h-[36px] truncate font-semibold capitalize text-[#683C21] font-['GE_Dinar_Two'] text-[13px]">
                          <svg
                            className="w-4 h-4 shrink-0"
                            viewBox="0 0 16 16"
                            fill="none"
                            xmlns="http://www.w3.org/2000/svg"
                          >
                            <path
                              d="M7.99991 14.4001C7.99991 14.4001 13.0086 9.94792 13.0086 6.60879C13.0086 3.84257 10.7661 1.6001 7.99991 1.6001C5.23368 1.6001 2.99121 3.84257 2.99121 6.60879C2.99121 9.94792 7.99991 14.4001 7.99991 14.4001Z"
                              stroke="#683C21"
                            />
                            <path
                              d="M9.60011 6.4002C9.60011 7.28385 8.88377 8.0002 8.00011 8.0002C7.11646 8.0002 6.40011 7.28385 6.40011 6.4002C6.40011 5.51654 7.11646 4.8002 8.00011 4.8002C8.88377 4.8002 9.60011 5.51654 9.60011 6.4002Z"
                              stroke="#683C21"
                            />
                          </svg>

                          {intl.formatMessage({
                            id: `projects.${project.slug}.title`,
                          })}
                        </div>

                        {/* عدد الأدوار */}
                        <div className="w-[85px] h-[36px] flex items-center justify-center bg-white/90 backdrop-blur-md rounded-full px-4 py-2 shadow-sm capitalize text-[#683C21] font-['GE_Dinar_Two'] truncate font-medium text-[13px]">
                          {intl.formatMessage({
                            id: `projects.${project.slug}.description.floors`,
                          })}
                        </div>

                        <div className="w-[65px] h-[36px] flex items-center justify-center bg-[#C9AA7B] text-white rounded-full px-3 py-2 shadow-sm capitalize font-['GE_Dinar_Two'] truncate font-bold text-[12px]">
                          {intl.formatMessage({
                            id: `projects.${project.slug}.description.availability`,
                          })}
                        </div>
                      </div>
                    </div>

                    <div className="flex flex-col justify-between gap-4 p-6 md:flex-row">
                      <div>
                        <span className="block font-bold text-[#683C21] font-['GE_Dinar_Two'] text-[22px] mb-3 group-hover:text-[#C9AA7B] transition-colors">
                          {intl.formatMessage(
                            { id: "projects.floorsLabel" },
                            {
                              title: intl.formatMessage({
                                id: `projects.${project.slug}.title`,
                              }),
                            },
                          )}
                        </span>

                        <div className="flex items-center gap-1 ">
                          <div className="flex items-center gap-1 font-medium">
                            <span className="text-[#683C21] font-['GE_Dinar_Two'] truncate text-[14px] ">
                              {intl.formatMessage({
                                id: `projects.${project.slug}.description.typeOne`,
                              })}
                            </span>

                            <span className="font-medium text-[#683C21]/40 font-['GE_Dinar_Two'] truncate text-[14px]">
                              {intl.formatMessage({
                                id: `projects.${project.slug}.description.typeTwo`,
                              })}
                            </span>
                          </div>

                          <div className="w-40 h-1.5 bg-[#F3F4F6] rounded-full overflow-hidden mt-1">
                            <div
                              className="h-full bg-[#C9AA7B]"
                              style={{
                                width: intl
                                  .formatMessage({
                                    id: `projects.${project.slug}.description.typeOne`,
                                  })
                                  .match(/\d+%/)![0],
                              }}
                            />
                          </div>
                        </div>
                      </div>

                      {/* نوع الوحدة - المساحة - السعر */}
                      <div className="flex flex-col justify-between items-end md:items-center text-[#683C21]/60 text-[14px]">
                        <div className="flex flex-row items-center gap-1 text-[14px]">
                          <svg
                            width="16"
                            height="16"
                            viewBox="0 0 16 16"
                            fill="none"
                            xmlns="http://www.w3.org/2000/svg"
                          >
                            <path
                              d="M10.6651 2.37012C11.1665 2.37004 11.6492 2.56069 12.0152 2.9034C12.3813 3.24611 12.6032 3.71521 12.6361 4.21556L12.6401 4.34512V6.35962C13.0634 6.44607 13.4468 6.66898 13.7313 6.99418C14.0158 7.31939 14.1859 7.72893 14.2153 8.16003L14.2201 8.29512V13.0351C14.2203 13.1338 14.1835 13.229 14.117 13.302C14.0505 13.3749 13.9591 13.4203 13.8608 13.4292C13.7625 13.4381 13.6644 13.4099 13.5858 13.3502C13.5073 13.2904 13.454 13.2033 13.4364 13.1062L13.4301 13.0351V11.0601H2.37008V13.0351C2.37026 13.1338 2.33348 13.229 2.26698 13.302C2.20047 13.3749 2.10907 13.4203 2.01077 13.4292C1.91247 13.4381 1.81438 13.4099 1.73584 13.3502C1.6573 13.2904 1.60398 13.2033 1.5864 13.1062L1.58008 13.0351V8.29512C1.57999 7.83982 1.7372 7.39847 2.02512 7.04577C2.31304 6.69307 2.71398 6.45068 3.16008 6.35962V4.34512C3.16 3.84369 3.35065 3.36101 3.69336 2.99497C4.03607 2.62894 4.50517 2.40696 5.00552 2.37407L5.13508 2.37012H10.6651ZM12.2451 7.11012H3.55508C3.26062 7.11011 2.97672 7.21973 2.75867 7.41762C2.54063 7.61551 2.40407 7.88749 2.37561 8.18057L2.37008 8.29512V10.2701H13.4301V8.29512C13.4301 8.00066 13.3205 7.71675 13.1226 7.49871C12.9247 7.28067 12.6527 7.14411 12.3596 7.11565L12.2451 7.11012ZM10.6651 3.16012H5.13508C4.8405 3.16013 4.55649 3.26986 4.33843 3.46792C4.12037 3.66597 3.98389 3.93814 3.95561 4.23136L3.95008 4.34512V6.32012H4.74008V5.92512C4.74008 5.82036 4.78169 5.71989 4.85577 5.64581C4.92985 5.57173 5.03032 5.53012 5.13508 5.53012H7.11008C7.21484 5.53012 7.31531 5.57173 7.38939 5.64581C7.46346 5.71989 7.50508 5.82036 7.50508 5.92512V6.32012H8.29508V5.92512C8.29508 5.82036 8.33669 5.71989 8.41077 5.64581C8.48485 5.57173 8.58532 5.53012 8.69008 5.53012H10.6651C10.7698 5.53012 10.8703 5.57173 10.9444 5.64581C11.0185 5.71989 11.0601 5.82036 11.0601 5.92512V6.32012H11.8501V4.34512C11.8501 4.05066 11.7405 3.76676 11.5426 3.54871C11.3447 3.33067 11.0727 3.19411 10.7796 3.16565L10.6651 3.16012Z"
                              fill="#683C21"
                            />
                          </svg>{" "}
                          {intl.formatMessage({
                            id: `projects.${project.slug}.description.type`,
                          })}
                        </div>
                        <div className="flex items-center gap-1 text-[15px]">
                          <svg
                            width="16"
                            height="16"
                            viewBox="0 0 9 9"
                            fill="none"
                            xmlns="http://www.w3.org/2000/svg"
                          >
                            <path
                              d="M6.89869 5.65743V2.51878C7.07304 2.4741 7.23247 2.38408 7.36079 2.25786C7.4891 2.13163 7.58173 1.9737 7.62926 1.8001C7.6768 1.6265 7.67755 1.44342 7.63144 1.26943C7.58533 1.09545 7.494 0.936761 7.36673 0.809489C7.23946 0.682216 7.08077 0.590888 6.90679 0.544779C6.7328 0.49867 6.54971 0.499421 6.37611 0.546956C6.20251 0.594492 6.04458 0.687119 5.91836 0.815432C5.79213 0.943745 5.70211 1.10317 5.65743 1.27753H2.51878C2.4741 1.10317 2.38408 0.943745 2.25786 0.815432C2.13163 0.687119 1.9737 0.594492 1.8001 0.546956C1.6265 0.499421 1.44342 0.49867 1.26943 0.544779C1.09545 0.590888 0.936761 0.682216 0.809489 0.809489C0.682216 0.936761 0.590888 1.09545 0.544779 1.26943C0.49867 1.44342 0.499421 1.6265 0.546956 1.8001C0.594492 1.9737 0.687119 2.13163 0.815432 2.25786C0.943745 2.38408 1.10317 2.4741 1.27753 2.51878V5.65743C1.10317 5.70211 0.943745 5.79213 0.815432 5.91836C0.687119 6.04458 0.594492 6.20251 0.546956 6.37611C0.499421 6.54971 0.49867 6.7328 0.544779 6.90679C0.590888 7.08077 0.682216 7.23946 0.809489 7.36673C0.936761 7.494 1.09545 7.58533 1.26943 7.63144C1.44342 7.67755 1.6265 7.6768 1.8001 7.62926C1.9737 7.58173 2.13163 7.4891 2.25786 7.36079C2.38408 7.23247 2.4741 7.07304 2.51878 6.89869H5.65743C5.70211 7.07304 5.79213 7.23247 5.91836 7.36079C6.04458 7.4891 6.20251 7.58173 6.37611 7.62926C6.54971 7.6768 6.7328 7.67755 6.90679 7.63144C7.08077 7.58533 7.23946 7.494 7.36673 7.36673C7.494 7.23946 7.58533 7.08077 7.63144 6.90679C7.67755 6.7328 7.6768 6.54971 7.62926 6.37611C7.58173 6.20251 7.4891 6.04458 7.36079 5.91836C7.23247 5.79213 7.07304 5.70211 6.89869 5.65743ZM6.64318 1.02202C6.74425 1.02202 6.84305 1.052 6.92708 1.10815C7.01112 1.1643 7.07662 1.24411 7.11529 1.33748C7.15397 1.43086 7.16409 1.53361 7.14437 1.63273C7.12466 1.73186 7.07599 1.82291 7.00452 1.89438C6.93305 1.96585 6.842 2.01452 6.74287 2.03423C6.64375 2.05395 6.541 2.04383 6.44762 2.00515C6.35425 1.96648 6.27444 1.90098 6.21829 1.81694C6.16214 1.73291 6.13216 1.63411 6.13216 1.53304C6.13216 1.39751 6.186 1.26753 6.28184 1.1717C6.37767 1.07586 6.50765 1.02202 6.64318 1.02202ZM1.02202 1.53304C1.02202 1.43197 1.052 1.33317 1.10815 1.24913C1.1643 1.1651 1.24411 1.0996 1.33748 1.06092C1.43086 1.02225 1.53361 1.01213 1.63273 1.03184C1.73186 1.05156 1.82291 1.10023 1.89438 1.1717C1.96585 1.24316 2.01452 1.33422 2.03423 1.43334C2.05395 1.53247 2.04383 1.63522 2.00515 1.7286C1.96648 1.82197 1.90098 1.90178 1.81694 1.95793C1.73291 2.01408 1.63411 2.04405 1.53304 2.04405C1.39751 2.04405 1.26753 1.99021 1.1717 1.89438C1.07586 1.79855 1.02202 1.66857 1.02202 1.53304ZM1.53304 7.15419C1.43197 7.15419 1.33317 7.12422 1.24913 7.06807C1.1651 7.01192 1.0996 6.93211 1.06092 6.83874C1.02225 6.74536 1.01213 6.64261 1.03184 6.54348C1.05156 6.44436 1.10023 6.3533 1.1717 6.28184C1.24316 6.21037 1.33422 6.1617 1.43334 6.14198C1.53247 6.12227 1.63522 6.13239 1.7286 6.17106C1.82197 6.20974 1.90178 6.27524 1.95793 6.35927C2.01408 6.44331 2.04405 6.54211 2.04405 6.64318C2.04405 6.77871 1.99021 6.90869 1.89438 7.00452C1.79855 7.10035 1.66857 7.15419 1.53304 7.15419ZM5.65743 6.38767H2.51878C2.47287 6.21208 2.38102 6.05187 2.25268 5.92353C2.12434 5.79519 1.96414 5.70335 1.78855 5.65743V2.51878C1.96414 2.47287 2.12434 2.38102 2.25268 2.25268C2.38102 2.12434 2.47287 1.96414 2.51878 1.78855H5.65743C5.70335 1.96414 5.79519 2.12434 5.92353 2.25268C6.05187 2.38102 6.21208 2.47287 6.38767 2.51878V5.65743C6.21196 5.7031 6.05162 5.79487 5.92325 5.92325C5.79487 6.05162 5.7031 6.21196 5.65743 6.38767ZM6.64318 7.15419C6.54211 7.15419 6.44331 7.12422 6.35927 7.06807C6.27524 7.01192 6.20974 6.93211 6.17106 6.83874C6.13239 6.74536 6.12227 6.64261 6.14198 6.54348C6.1617 6.44436 6.21037 6.3533 6.28184 6.28184C6.3533 6.21037 6.44436 6.1617 6.54348 6.14198C6.64261 6.12227 6.74536 6.13239 6.83874 6.17106C6.93211 6.20974 7.01192 6.27524 7.06807 6.35927C7.12422 6.44331 7.15419 6.54211 7.15419 6.64318C7.15399 6.77865 7.10009 6.90851 7.0043 7.0043C6.90851 7.10009 6.77865 7.15399 6.64318 7.15419Z"
                              fill="#683C21"
                            />
                          </svg>
                          {intl.formatMessage({
                            id: `projects.${project.slug}.description.area`,
                          })}
                        </div>
                        <div className="mt-2">
                          {/* السعر */}
                          <span className="text-[#683C21] font-bold text-[18px]">
                            {intl.formatMessage({
                              id: `projects.${project.slug}.description.price`,
                            })}
                          </span>

                          {/* العملة */}
                          <span className="text-[#C9AA7B] ml-1 font-medium">
                            {intl.formatMessage({
                              id: `projects.${project.slug}.description.currency`,
                            })}
                          </span>
                        </div>
                      </div>
                    </div>
                  </div>
                </Link>
              </SwiperSlide>
            ))}
          </Swiper>
        </div>
      </div>

      {/* Mobile View - 3 Projects Vertical */}
      <div className="flex flex-col gap-4 md:hidden">
        {projectsData.slice(0, 3).map((project: Project, idx: number) => (
          <Link
            key={project.id}
            href={`/projects/${project.slug}`}
            className="block"
          >
            <div className="overflow-hidden bg-white shadow-md rounded-2xl">
              {/* الصورة */}
              <div className="relative w-full h-64 sm:h-80">
                <Image
                  src={staticImages[idx % staticImages.length]}
                  alt={intl.formatMessage({
                    id: `projects.${project.slug}.title`,
                  })}
                  fill
                  className="object-cover"
                />

                {/* معلومات فوق الصورة */}
                <div className="absolute flex flex-wrap items-center gap-1 top-2 left-2 right-2">
                  {/* اسم المشروع مع أيقونة */}
                  <div className=" flex items-center gap-.8 bg-white rounded-full px-2 py-1 shadow-sm w-[80px] h-[20px] truncate  text-[#683C21]/40 font-medium font-['GE_Dinar_Two'] text-[8.24px]">
                    <svg
                      width="8"
                      height="8"
                      viewBox="0 0 16 16"
                      fill="none"
                      xmlns="http://www.w3.org/2000/svg"
                    >
                      <path
                        d="M7.99991 14.4001C7.99991 14.4001 13.0086 9.94792 13.0086 6.60879C13.0086 3.84257 10.7661 1.6001 7.99991 1.6001C5.23368 1.6001 2.99121 3.84257 2.99121 6.60879C2.99121 9.94792 7.99991 14.4001 7.99991 14.4001Z"
                        stroke="#683C21"
                      />
                      <path
                        d="M9.60011 6.4002C9.60011 7.28385 8.88377 8.0002 8.00011 8.0002C7.11646 8.0002 6.40011 7.28385 6.40011 6.4002C6.40011 5.51654 7.11646 4.8002 8.00011 4.8002C8.88377 4.8002 9.60011 5.51654 9.60011 6.4002Z"
                        stroke="#683C21"
                      />
                    </svg>
                    {intl.formatMessage({
                      id: `projects.${project.slug}.title`,
                    })}
                  </div>

                  {/* عدد الأدوار */}
                  <div className="w-15 text-center bg-white rounded-full px-3 py-1 shadow-sm  text-[#683C21]/40 font-['GE_Dinar_Two']  truncate font-medium text-[7.5px]">
                    {intl.formatMessage({
                      id: `projects.${project.slug}.description.floors`,
                    })}
                  </div>

                  {/* حالة التوفر */}
                  <div className="w-15 text-center bg-white rounded-full px-3 py-1 shadow-sm text-[#683C21]/40 font-['GE_Dinar_Two'] truncate font-medium text-[7.5px]">
                    {intl.formatMessage({
                      id: `projects.${project.slug}.description.availability`,
                    })}
                  </div>
                </div>
              </div>

              {/* أسفل الصورة */}
              <div className="flex flex-row justify-between gap-2 p-2 ">
                {/* شريط البيع */}
                <div>
                  <span className="block font-semibold text-[#683C21] font-['GE_Dinar_Two'] text-[12.5px] mb-1">
                    {intl.formatMessage(
                      { id: "projects.floorsLabel" },
                      {
                        title: intl.formatMessage({
                          id: `projects.${project.slug}.title`,
                        }),
                      },
                    )}
                  </span>

                  <div className="flex items-center gap-1 ">
                    <div className="flex items-center gap-1 font-medium">
                      <span className="text-[#683C21] font-['GE_Dinar_Two'] truncate text-[8.5px] ">
                        {intl.formatMessage({
                          id: `projects.${project.slug}.description.typeOne`,
                        })}
                      </span>

                      <span className="font-medium text-[#683C21]/40 font-['GE_Dinar_Two'] truncate text-[8.5px]">
                        {intl.formatMessage({
                          id: `projects.${project.slug}.description.typeTwo`,
                        })}
                      </span>
                    </div>

                    <div className="w-32 h-2 bg-[#EADEC6] rounded overflow-hidden">
                      <div
                        className="h-full bg-[#C9AA7B]"
                        style={{
                          width: intl
                            .formatMessage({
                              id: `projects.${project.slug}.description.typeOne`,
                            })
                            .match(/\d+%/)![0],
                        }}
                      />
                    </div>
                  </div>
                </div>

                {/* نوع الوحدة - المساحة - السعر */}
                <div className="flex flex-col justify-between items-center text-[#683C21]/40 text-[7.5px] mt-1">
                  <div className="flex items-center gap-1">
                    <svg
                      width="37"
                      height="9"
                      viewBox="0 0 37 9"
                      fill="none"
                      xmlns="http://www.w3.org/2000/svg"
                    >
                      <path
                        opacity="0.4"
                        d="M2.98484 2.77631C2.98484 3.01538 2.79648 3.21099 2.54291 3.21099C2.30383 3.21099 2.09373 3.02987 2.09373 2.76906C2.09373 2.52999 2.30383 2.33438 2.54291 2.33438C2.77474 2.33438 2.98484 2.52274 2.98484 2.77631ZM1.83292 2.77631C1.83292 3.01538 1.63731 3.21099 1.38375 3.21099C1.15192 3.21099 0.941818 3.02987 0.941818 2.76906C0.941818 2.52999 1.15192 2.33438 1.38375 2.33438C1.62283 2.33438 1.83292 2.52274 1.83292 2.77631ZM3.46299 5.34095C3.46299 5.83359 3.3181 6.23206 3.03555 6.54358C2.75301 6.84786 2.36903 7 1.89813 7C1.44171 7 1.07947 6.8551 0.804168 6.56531C0.536112 6.26828 0.398462 5.87706 0.398462 5.39166C0.398462 4.89178 0.536112 4.47883 0.811413 4.1673C1.08671 3.85578 1.47793 3.69639 1.97782 3.69639C2.90515 3.69639 3.46299 4.30495 3.46299 5.34095ZM2.6878 5.34095C2.6878 4.57301 2.44148 4.18904 1.94884 4.18904C1.42722 4.18904 1.16641 4.57301 1.16641 5.34095C1.16641 6.11614 1.41997 6.50736 1.91986 6.50736C2.43424 6.50736 2.6878 6.11614 2.6878 5.34095ZM7.39367 7H4.15526L4.34363 6.34797H6.17655L6.19828 6.19583V5.43513C6.19828 5.08014 6.12584 4.80484 5.98819 4.59474C5.85778 4.41362 5.69115 4.31944 5.48105 4.31944C5.41585 4.31944 5.33616 4.33393 5.25647 4.37015C5.25647 4.29771 5.24198 4.16006 5.22024 3.96445C5.24198 3.96445 5.32167 3.9572 5.44483 3.93547C5.88676 3.93547 6.24175 4.08761 6.50981 4.39913C6.77786 4.70341 6.91551 5.08738 6.92276 5.55829V6.34073V6.34797H7.39367V7ZM11.365 7H7.22823V6.34797H10.358C10.1841 5.94951 9.94501 5.53656 9.63349 5.12361C9.23502 4.58025 8.88003 4.3122 8.583 4.3122C8.36565 4.3122 8.25698 4.44985 8.25698 4.7179C8.25698 4.84831 8.29321 5.00769 8.35841 5.2033L7.60495 5.29024C7.68465 4.34117 8.17729 3.76884 8.81483 3.76884C9.36543 3.76884 9.93052 4.17455 10.5029 4.9932C11.0317 5.74666 11.3143 6.41317 11.365 7ZM14.782 6.70297C14.782 7.70999 14.2604 8.34028 13.2244 8.60834L13.0723 8.30406C13.6736 8.14467 13.9996 7.72448 14.0648 7.03622C13.8112 7.11592 13.5577 7.15938 13.2896 7.15938C12.9201 7.15938 12.6231 7.00724 12.3912 6.71021C12.1667 6.43491 12.058 6.10165 12.058 5.70319C12.058 5.19606 12.1956 4.7831 12.4709 4.45709C12.768 4.10934 13.1592 3.93547 13.6591 3.93547H14.782V6.70297ZM14.072 6.54358V4.37015H13.6881C13.1085 4.37015 12.768 4.83382 12.768 5.58727C12.768 6.3045 12.9926 6.66674 13.4417 6.66674C13.6591 6.66674 13.8692 6.62327 14.072 6.54358ZM19.7795 2.33438L19.2579 3.08059L18.5334 2.97192H17.483V7H16.7512L16.7657 2.33438H19.7795ZM24.8843 2.33438L24.4424 3.14579L23.2398 7H22.4356L21.233 3.14579L20.791 2.33438H21.7763C21.7981 2.52999 22.153 3.81231 22.8341 6.18134C23.2398 4.88453 23.5078 3.94996 23.6455 3.36313C23.8048 2.70386 23.8918 2.35611 23.899 2.33438H24.8843Z"
                        fill="#683C21"
                      />
                      <path
                        d="M33.589 1.63818C33.8485 1.63814 34.0983 1.7368 34.2877 1.91415C34.4771 2.09149 34.592 2.33425 34.609 2.59317L34.6111 2.66021V3.70268C34.8301 3.74742 35.0285 3.86277 35.1757 4.03106C35.323 4.19934 35.411 4.41127 35.4262 4.63436L35.4287 4.70427V7.15714C35.4288 7.20821 35.4097 7.25748 35.3753 7.29522C35.3409 7.33297 35.2936 7.35647 35.2427 7.36108C35.1919 7.3657 35.1411 7.3511 35.1005 7.32016C35.0598 7.28922 35.0322 7.24419 35.0231 7.19393L35.0199 7.15714V6.13511H29.2965V7.15714C29.2966 7.20821 29.2776 7.25748 29.2432 7.29522C29.2087 7.33297 29.1614 7.35647 29.1106 7.36108C29.0597 7.3657 29.0089 7.3511 28.9683 7.32016C28.9277 7.28922 28.9001 7.24419 28.891 7.19393L28.8877 7.15714V4.70427C28.8876 4.46866 28.969 4.24027 29.118 4.05775C29.267 3.87524 29.4745 3.7498 29.7053 3.70268V2.66021C29.7053 2.40073 29.8039 2.15095 29.9813 1.96153C30.1586 1.77212 30.4014 1.65725 30.6603 1.64023L30.7273 1.63818H33.589ZM34.4066 4.09105H29.9097C29.7573 4.09105 29.6104 4.14778 29.4976 4.25018C29.3848 4.35258 29.3141 4.49333 29.2994 4.64499L29.2965 4.70427V5.7263H35.0199V4.70427C35.0199 4.55189 34.9631 4.40498 34.8607 4.29214C34.7583 4.17931 34.6176 4.10864 34.4659 4.09391L34.4066 4.09105ZM33.589 2.04699H30.7273C30.5749 2.047 30.4279 2.10379 30.3151 2.20628C30.2022 2.30876 30.1316 2.44961 30.117 2.60134L30.1141 2.66021V3.68224H30.5229V3.47783C30.5229 3.42362 30.5445 3.37163 30.5828 3.3333C30.6211 3.29496 30.6731 3.27343 30.7273 3.27343H31.7494C31.8036 3.27343 31.8556 3.29496 31.8939 3.3333C31.9322 3.37163 31.9538 3.42362 31.9538 3.47783V3.68224H32.3626V3.47783C32.3626 3.42362 32.3841 3.37163 32.4225 3.3333C32.4608 3.29496 32.5128 3.27343 32.567 3.27343H33.589C33.6432 3.27343 33.6952 3.29496 33.7336 3.3333C33.7719 3.37163 33.7934 3.42362 33.7934 3.47783V3.68224H34.2022V2.66021C34.2022 2.50784 34.1455 2.36092 34.0431 2.24809C33.9407 2.13525 33.8 2.06459 33.6483 2.04986L33.589 2.04699Z"
                        fill="#683C21"
                      />
                    </svg>
                  </div>
                  <div className="flex items-center gap-1">
                    <svg
                      width="8"
                      height="8"
                      viewBox="0 0 9 9"
                      fill="none"
                      xmlns="http://www.w3.org/2000/svg"
                    >
                      <path
                        d="M6.89869 5.65743V2.51878C7.07304 2.4741 7.23247 2.38408 7.36079 2.25786C7.4891 2.13163 7.58173 1.9737 7.62926 1.8001C7.6768 1.6265 7.67755 1.44342 7.63144 1.26943C7.58533 1.09545 7.494 0.936761 7.36673 0.809489C7.23946 0.682216 7.08077 0.590888 6.90679 0.544779C6.7328 0.49867 6.54971 0.499421 6.37611 0.546956C6.20251 0.594492 6.04458 0.687119 5.91836 0.815432C5.79213 0.943745 5.70211 1.10317 5.65743 1.27753H2.51878C2.4741 1.10317 2.38408 0.943745 2.25786 0.815432C2.13163 0.687119 1.9737 0.594492 1.8001 0.546956C1.6265 0.499421 1.44342 0.49867 1.26943 0.544779C1.09545 0.590888 0.936761 0.682216 0.809489 0.809489C0.682216 0.936761 0.590888 1.09545 0.544779 1.26943C0.49867 1.44342 0.499421 1.6265 0.546956 1.8001C0.594492 1.9737 0.687119 2.13163 0.815432 2.25786C0.943745 2.38408 1.10317 2.4741 1.27753 2.51878V5.65743C1.10317 5.70211 0.943745 5.79213 0.815432 5.91836C0.687119 6.04458 0.594492 6.20251 0.546956 6.37611C0.499421 6.54971 0.49867 6.7328 0.544779 6.90679C0.590888 7.08077 0.682216 7.23946 0.809489 7.36673C0.936761 7.494 1.09545 7.58533 1.26943 7.63144C1.44342 7.67755 1.6265 7.6768 1.8001 7.62926C1.9737 7.58173 2.13163 7.4891 2.25786 7.36079C2.38408 7.23247 2.4741 7.07304 2.51878 6.89869H5.65743C5.70211 7.07304 5.79213 7.23247 5.91836 7.36079C6.04458 7.4891 6.20251 7.58173 6.37611 7.62926C6.54971 7.6768 6.7328 7.67755 6.90679 7.63144C7.08077 7.58533 7.23946 7.494 7.36673 7.36673C7.494 7.23946 7.58533 7.08077 7.63144 6.90679C7.67755 6.7328 7.6768 6.54971 7.62926 6.37611C7.58173 6.20251 7.4891 6.04458 7.36079 5.91836C7.23247 5.79213 7.07304 5.70211 6.89869 5.65743ZM6.64318 1.02202C6.74425 1.02202 6.84305 1.052 6.92708 1.10815C7.01112 1.1643 7.07662 1.24411 7.11529 1.33748C7.15397 1.43086 7.16409 1.53361 7.14437 1.63273C7.12466 1.73186 7.07599 1.82291 7.00452 1.89438C6.93305 1.96585 6.842 2.01452 6.74287 2.03423C6.64375 2.05395 6.541 2.04383 6.44762 2.00515C6.35425 1.96648 6.27444 1.90098 6.21829 1.81694C6.16214 1.73291 6.13216 1.63411 6.13216 1.53304C6.13216 1.39751 6.186 1.26753 6.28184 1.1717C6.37767 1.07586 6.50765 1.02202 6.64318 1.02202ZM1.02202 1.53304C1.02202 1.43197 1.052 1.33317 1.10815 1.24913C1.1643 1.1651 1.24411 1.0996 1.33748 1.06092C1.43086 1.02225 1.53361 1.01213 1.63273 1.03184C1.73186 1.05156 1.82291 1.10023 1.89438 1.1717C1.96585 1.24316 2.01452 1.33422 2.03423 1.43334C2.05395 1.53247 2.04383 1.63522 2.00515 1.7286C1.96648 1.82197 1.90098 1.90178 1.81694 1.95793C1.73291 2.01408 1.63411 2.04405 1.53304 2.04405C1.39751 2.04405 1.26753 1.99021 1.1717 1.89438C1.07586 1.79855 1.02202 1.66857 1.02202 1.53304ZM1.53304 7.15419C1.43197 7.15419 1.33317 7.12422 1.24913 7.06807C1.1651 7.01192 1.0996 6.93211 1.06092 6.83874C1.02225 6.74536 1.01213 6.64261 1.03184 6.54348C1.05156 6.44436 1.10023 6.3533 1.1717 6.28184C1.24316 6.21037 1.33422 6.1617 1.43334 6.14198C1.53247 6.12227 1.63522 6.13239 1.7286 6.17106C1.82197 6.20974 1.90178 6.27524 1.95793 6.35927C2.01408 6.44331 2.04405 6.54211 2.04405 6.64318C2.04405 6.77871 1.99021 6.90869 1.89438 7.00452C1.79855 7.10035 1.66857 7.15419 1.53304 7.15419ZM5.65743 6.38767H2.51878C2.47287 6.21208 2.38102 6.05187 2.25268 5.92353C2.12434 5.79519 1.96414 5.70335 1.78855 5.65743V2.51878C1.96414 2.47287 2.12434 2.38102 2.25268 2.25268C2.38102 2.12434 2.47287 1.96414 2.51878 1.78855H5.65743C5.70335 1.96414 5.79519 2.12434 5.92353 2.25268C6.05187 2.38102 6.21208 2.47287 6.38767 2.51878V5.65743C6.21196 5.7031 6.05162 5.79487 5.92325 5.92325C5.79487 6.05162 5.7031 6.21196 5.65743 6.38767ZM6.64318 7.15419C6.54211 7.15419 6.44331 7.12422 6.35927 7.06807C6.27524 7.01192 6.20974 6.93211 6.17106 6.83874C6.13239 6.74536 6.12227 6.64261 6.14198 6.54348C6.1617 6.44436 6.21037 6.3533 6.28184 6.28184C6.3533 6.21037 6.44436 6.1617 6.54348 6.14198C6.64261 6.12227 6.74536 6.13239 6.83874 6.17106C6.93211 6.20974 7.01192 6.27524 7.06807 6.35927C7.12422 6.44331 7.15419 6.54211 7.15419 6.64318C7.15399 6.77865 7.10009 6.90851 7.0043 7.0043C6.90851 7.10009 6.77865 7.15399 6.64318 7.15419Z"
                        fill="#683C21"
                      />
                    </svg>
                    {intl.formatMessage({
                      id: `projects.${project.slug}.description.area`,
                    })}
                  </div>
                  <div>
                    {/* السعر */}
                    <span className="text-[#683C21]">
                      {intl.formatMessage({
                        id: `projects.${project.slug}.description.price`,
                      })}
                    </span>

                    {/* العملة */}
                    <span className="text-[#C9AA7B] ml-1">
                      {intl.formatMessage({
                        id: `projects.${project.slug}.description.currency`,
                      })}
                    </span>
                  </div>
                </div>
              </div>
            </div>
          </Link>
        ))}
      </div>

      <ReusableTextWithArrows
        showContent={false}
        onPrev={() => swiperRef.current?.slidePrev()}
        onNext={() => swiperRef.current?.slideNext()}
        className="flex justify-center mt-4 md:hidden"
      />
    </section>
  );
}
